{
    "title": "ประวัติการทำงาน",
    "employment": [
        {
            "company": "ริงซีโรเกมสตูดิโอ",
            "time": "มกราคม 2023 - ปัจจุบัน",
            "job": "Unity Developer",
            "detail": [
                "เป็นส่วนหนึ่งในการพัฒนาเกมตั้งแต่แนวคิดจนถึงการเปิดตัว โดยให้ความสำคัญกับกลไกการเล่น UI/UX และการปรับปรุงประสิทธิภาพ",
                "เป็นส่วนหนึ่งในการพัฒนามินมเกม โดยร่วมมือกับนักพัฒนาระบบหลังบ้านในการใช้ API และคุณสมบัติที่จำเป็นสำหรับประสบการณ์ผู้ใช้",
                "ใช้ Nodejs และ MongoDB เพื่อเก็บข้อมูลผู้เล่นสำหรับเกมออนไลน์ เพื่อที่ดำเนินการและธุรกรรมของเกมได้ถูกจัดการอย่างมีประสิทธิภาพ",
                "ร่วมมือกับนักพัฒนาอื่นๆ เพื่อให้พัฒนาแอพพลิเคชั่นอย่างเป็นระบบ",
                "นำ Unity animator controller, animation timeline และ blendtree เพื่อสร้างประสบการณ์เล่นเกมที่ดีเยี่ยม",
                "ทำการทดสอบและแก้ไขข้อบกพร่องของระบบ เพื่อให้ผู้เล่นได้รับประสบการณ์ที่ดีที่สุด",
                "นำเครื่องมือในการดีบักซ์จากภายนอก เช่น ADB, Chrome Remote Devices และนำ Unity Addressables มาใช้เพื่อปรับปรุงการจัดการโหลดทรัพยากรในโปรเจ็คขนาดใหญ่"
            ]
        },
        {
            "company": "บลูโอเชียนเทคโนลียี",
            "time": "กันยายน 2021 - ธันวาคม 2022",
            "job": "Unity Developer",
            "detail": [
                "พัฒนาคอนโทรลเลอร์ของยานพาหนะในมินิเกมย่อยและระบบจำลองการขับขี่โดยใช้วีลคอนโทรลเลอร์ เพื่อเพิ่มประสบการณ์ของผู้ใช้",
                "ออกแบบและสร้างแอพพลิเคชั่นเพื่อประสบการณ์การเล่นในโลกเสมือนจริงสำหรับแพลตฟอร์ม Oculus Quest โดยให้ความสำคัญกับการท่องเที่ยวอย่างมีเสน่ห์ในฟาร์มของ Kubota และใช้ WebGL เพื่อสร้างเว็บแอพพลิเคชันที่สามารถแก้ไขวัสดุและเนื้อหาแบบเรียลไทม์",
                "พัฒนาแอปพลิเคชัน WebGL ที่สามารถสร้างประสบการณ์โต้ตอบให้ผู้ใช้สามารถสำรวจงานเทศกาลและการแสดงโดยการคลิกที่องค์ประกอบต่างๆ ในสภาพแวดล้อม",
                "นำระบบ asset bundle มาใช้เพื่อโหลดรูปภาพและวิดีโอโดยมีประสิทธิภาพ เพิ่มประสิทธิภาพและเวลาโหลดของแอปพลิเคชัน WebGL",
                "ร่วมมือกับนักออกแบบและศิลปินในการสร้างแอพพลิเคชั่นที่น่าสนใจทางสายตา เพื่อให้ผู้ใช้ได้รับประสบการณ์ที่น่าสนใจ"
            ]
        }
    ]
}